# 1 

# ფუნქცია (Function) არის კოდის ნაწილი, რომელსაც აქვს კონკრეტული დანიშნულება.
# მისი მიზანია, რომ კოდი იყოს უფრო მარტივი, ორგანიზებული და გამეორებადი.


# 2

#numbers = [10, 20, 30, 40, 50]

#print(numbers[0])
#print(numbers[2])
#print(numbers[4])

#print(numbers.index(30))
#print(numbers.index(50))

# 3

#name = input("შეიყვანეთ სახელი: ")
#index = int(input("შეიყვანეთ index (რიცხვი): "))

#names = ["Gio", "Luka", "Ana", "Mari"]

#names.insert(index, name)

#print(names)

# 4

# String method-ები არის წინასწარ შექმნილი ფუნქციები
# რომლებიც გამოიყენება ტექსტური მონაცემების (string-ების) დასამუშავებლად
# მათი გამოყენებით შეგვიძლია:
# ტექსტის გადაკეთება (დიდი/პატარა ასოები)
# სიმბოლოების შეცვლა
# შეწყვეტა გაყოფა გაერთიანება და სხვა მრავალი მოქმედება.


#name = input("შეიყვანეთ თქვენი სახელი: ")

#result = name.capitalize()

#print("თქვენი სახელი ფორმატირებულად არის:", result)


# 5

# 1) FUNCTION

# - ფუნქცია არის დამოუკიდებელი კოდის ბლოკი
# - ის შეიძლება გამოვიძახოთ მისი სახელით ნებისმიერ ადგილას
# - ფუნქცია არ არის მიბმული კონკრეტულ მონაცემთა ტიპზე (მაგ: string, list)

# 2) METHOD

# - მეთოდი არის ფუნქცია, რომელიც ეკუთვნის (ჩართულია) კონკრეტულ ობიექტს ან მონაცემის ტიპს
# - მისი გამოძახება შეიძლება მხოლოდ მონაცემის ტიპის საშუალებით (მაგ: string, list, dict)


name = '    N I N O     '

# strip() მეთოდი აშორებს ზედმეტ space-ებს ტექსტის დასაწყისსა და ბოლოში
clean_name = name.strip()

print(clean_name)